ChartsOfCharacteristicTypes/ВидыСкоринга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ВидыСкоринга</Name>
			<Comment>Трейд Софт</Comment>
			<Type>
				<v8:Type>cfg:CatalogRef.Категории</v8:Type>
			</Type>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПользовательскиеПоля</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоляГруппировок</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросИзменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизвольнаяПроцедура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Catalogs/Категории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Категории</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.ВидыСкоринга</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ChartsOfCharacteristicTypes/ВидыСкоринга/Forms/ФормаЭлемента/Ext/Form/Module.bsl
Перем СКД;

&НаСервере
Процедура ПриОткрытиНаСервере()
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	Расписание = СправочникОбъект.ВернутьСодержимоеХранилища();
	Если Расписание = Неопределено Тогда
		Расписание = Новый РасписаниеРегламентногоЗадания();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ВсеХорошо = КонтрольВыполняемогоЗапроса();
	Если Не ВсеХорошо Тогда
	
		Отказ = Истина;
	
	КонецЕсли;
	
	Если Не Отказ Тогда
		ПоместитьВХранилищеДанные();
	КонецЕсли;
	
	ЗаписатьПользовательскиеПоляКомпоновщика();
	
КонецПроцедуры

&НаСервере
Функция ЗаписьСервер()
	СсылкаНаОбъект = РеквизитФормыВЗначение("Объект");
	СсылкаНаОбъект.ПользовательскиеПоля = Новый ХранилищеЗначения(Компоновщик.Настройки);
	СсылкаНаОбъект.Записать();
	ЗначениеВРеквизитФормы(СсылкаНаОбъект, "Объект");
	  
	Нстр = Объект.Ссылка.ПользовательскиеПоля.Получить(); // ?
	Возврат Ложь;
КонецФункции

#Область ОбработкаОповещений

&НаКлиенте
Процедура ИзменитьЗапросЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт	

	Если РезультатЗакрытия <> Неопределено Тогда
		Объект.ПроизвольнаяПроцедура = Ложь;
		Модифицированность = Истина;
		Объект.ЗапросМакета = РезультатЗакрытия.ТекстЗапроса;
	КонецЕсли;
	
	КонтрольВыполняемогоЗапроса();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВидыСкорингаФормаЗапросаЗавершение" Тогда
		Объект.ПроизвольнаяПроцедура = Истина;
		Модифицированность = Истина;
		Объект.ЗапросМакета = Параметр.ПолучитьТекст();
		Объект.Объекты.Очистить();
	ИначеЕсли ИмяСобытия = "ВидыСкорингаФормаЗапросаСКДЗавершение" Тогда
		Объект.ПроизвольнаяПроцедура = Ложь;
		Модифицированность = Истина;
		Объект.ЗапросМакета = Параметр;
		Объект.Объекты.Очистить();
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Категории")
		И ИмяСобытия = "ОбновитьКатегориюСкоринга" Тогда
	
		ОбновитьКатегориюСкоринга(Параметр["КодКатегории"], Параметр["Отбор"]);
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УправлениеОтборамиКомпоновщика

&НаКлиенте
Функция ПолучитьВариантыОтборов() Экспорт

	Возврат Компоновщик
				.Настройки
				.ПользовательскиеПоля.Элементы[0]
				.Варианты
				.Элементы;

КонецФункции // ()

&НаКлиенте
Функция ПолучитьТекущийВариантОтбора(КодОтбора) Экспорт

	ВариантыОтборов = ПолучитьВариантыОтборов();
	
	Для Каждого ЭлементОтбор Из ВариантыОтборов Цикл
		Если ЭлементОтбор.Значение = КодОтбора Тогда
			Возврат ЭлементОтбор.Отбор;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции // ()

#КонецОбласти

#Область ОбработкаКонструктораЗапросов

&НаКлиенте
Процедура ИзменитьЗапрос(Команда)
	Форма = ПолучитьФорму("ПланВидовХарактеристик.ВидыСкоринга.Форма.ФормаКонструктора",, ЭтаФорма);
	Форма.ТекстЗапроса = СтрЗаменить(Объект.ЗапросМакета, "|", "");
	
	//Чуров***
	ОткрытьФорму(Форма,,ЭтаФорма,Истина,,,Новый ОписаниеОповещения("ИзменитьЗапросЗавершение", ЭтаФорма));

КонецПроцедуры

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)

	КонтрольВыполняемогоЗапроса();
	
	ИзменитьЗапрос(Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоШаблонуДляОбъект(Команда)

	Объект.ПроизвольнаяПроцедура = Ложь;
	Модифицированность = Истина;
	
	НазначениеПриИзменении(Команда);

КонецПроцедуры

&НаСервере
Функция КонтрольВыполняемогоЗапроса()

	Компоновка = ИзменитьСКД();
	
	ИзменитьКомпоновщик(Компоновка);
	
	ТекстОшибки = ПроверитьПоляКомпоновщика();
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
	
		ТекстСообщения = УправленияСообщениями.ПредупреждениеОбПользовательскойОшибке(
			ТекстОшибки
		);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
		
		Возврат Ложь;
	
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ОбновитьКатегориюСкоринга(КодКатегории, Отбор)

	ВариантОтбора = ПолучитьТекущийВариантОтбора(КодКатегории);
	Если ВариантОтбора = Неопределено Тогда
	
		ВариантыОтбора = ПолучитьВариантыОтборов();
		ЭлементОтбора = ВариантыОтбора.Добавить();
		ЭлементОтбора.Значение = КодКатегории;
		ВариантОтбора = ЭлементОтбора.Отбор;
	
	КонецЕсли;
	
	ВариантОтбора.Элементы.Очистить();
	
	ЗаполнитьВариантОтбора(ВариантОтбора, Отбор.Элементы);
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьВариантОтбора(ГруппаОтбора, НаборОтбора)

	Для каждого Элемент Из НаборОтбора Цикл
		
		Запись = ГруппаОтбора.Элементы.Добавить(Тип(Элемент));
		ЗаполнитьЗначенияСвойств(Запись, Элемент);
		
		Если ТипЗнч(Элемент) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		
			ЗаполнитьВариантОтбора(
				ГруппаОтбора.Элементы[ГруппаОтбора.Элементы.Количество() - 1],
				Элемент.Элементы);
		
		КонецЕсли;
	
	КонецЦикла;

КонецФункции // ()

&НаСервере
Функция ИзменитьСКД()

	СКД = ПланыВидовХарактеристик.ВидыСкоринга.ПолучитьМакет("Макет");
	Если Не Объект.ПроизвольнаяПроцедура Тогда
		СКД.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(
			Объект.ЗапросМакета,
			"|",
			""
		);
	КонецЕсли;
	
	Возврат СКД;

КонецФункции

&НаСервере
Процедура ИзменитьКомпоновщик(Компоновка)

	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	Компоновщик.Инициализировать(Источник);

КонецПроцедуры

&НаСервере
Функция ПроверитьПоляКомпоновщика()

	СписокПолей = Новый СписокЗначений;
	СписокПолей.Добавить("Объект", "Объекты");
	
	ИмяСправочника = ПолучитьИмяСправочника(Объект.ОбъектУчета);
	ТипПоля = Тип("СправочникСсылка." + ИмяСправочника);
	
	ЭлементыГруппировок = Компоновщик.Настройки.ДоступныеПоляГруппировок.Элементы;
	ОшибкиВКомпоновщике = Новый Массив;
	Для Каждого ЭлементСписка Из СписокПолей Цикл

		Поле = ЭлементыГруппировок.Найти(ЭлементСписка.Значение);
		Если Поле = Неопределено Тогда
			
			ОшибкиВКомпоновщике.Добавить(
				"В запросе необходимо указать поле """
				+ ЭлементСписка.Значение + """ (Объект скоринга)!"
			);
			
			Продолжить;
			
		КонецЕсли;

		Если Не Поле.Тип.СодержитТип(ТипПоля) Тогда
			
			ОшибкиВКомпоновщике.Добавить(
				"Несоответствие типов для поля """
				+ ЭлементСписка.Значение + """!"
			);
			
			Продолжить;

		КонецЕсли;
	
	КонецЦикла;
	
	Если ОшибкиВКомпоновщике.Количество() > 0 Тогда
	
		ТекстОшибки = СтрСоединить(ОшибкиВКомпоновщике, Символы.ПС);
		Возврат ТекстОшибки;
	
	КонецЕсли;
	
	Возврат "";

КонецФункции

&НаКлиенте
Процедура ТабличноеПоле1ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)

	ИзменитьЗапрос(Неопределено);
	КонтрольВыполняемогоЗапроса();

КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПоле1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	КонтрольВыполняемогоЗапроса();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКатегорий

&НаКлиенте
Процедура КатегорииПередНачаломИзменения(Элемент, Отказ)

	КонтрольВыполняемогоЗапроса();
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорииОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Элементы.Категории.Обновить();	
КонецПроцедуры

&НаКлиенте
Процедура КатегорииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.Ссылка.Пустая() Тогда
		Попытка
			Записать();
		Исключение
			Сообщить("Перед началом добавления необходимо сохранить объект!");
			Отказ = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Если Не Отказ И Копирование Тогда
		Отказ = Истина;
		ТекущаяСтрока = Элементы.Категории.ТекущаяСтрока;
		Если ТекущаяСтрока <> Неопределено Тогда
			КодКатегорииРодителя = Неопределено;
			КодНовойКатегории = Неопределено;	
			НоваяКатегория = СкопироватьКатегориюНаСервере(ТекущаяСтрока, КодНовойКатегории, КодКатегорииРодителя);
			Элементы.Категории.ТекущаяСтрока = НоваяКатегория;
			
			//Скопировать строку настройки из компановщика
			Для Каждого Элемент Из Компоновщик.Настройки.ПользовательскиеПоля.Элементы[0].Варианты.Элементы Цикл
				Если Элемент.Значение = КодКатегорииРодителя Тогда
					НоваяСтрока = Компоновщик.Настройки.ПользовательскиеПоля.Элементы[0].Варианты.Элементы.Добавить();
					НоваяСтрока.Значение = КодНовойКатегории;
					
					Массив = Новый Массив();
					Для Индекс = 0 По Элемент.КомпоновщикНастроек.Настройки.Отбор.Элементы.Количество() - 1 Цикл
						ЗаписатьЭлементОтбора(Элемент.КомпоновщикНастроек.Настройки.Отбор.Элементы[Индекс], Массив);		
					КонецЦикла;
					Для Индекс = 0 По Массив.Количество() - 1 Цикл 
						ВосстановитьЭлементОтбора(НоваяСтрока.КомпоновщикНастроек.Настройки.Отбор.Элементы, Массив[Индекс]);
					КонецЦикла;	
					
					Прервать;
			    КонецЕсли;
			КонецЦикла;		
			Записать();

			//Открыть
			//ОткрытьЗначение(НоваяКатегория);	
			Форма = ПолучитьФорму("Справочник.Категории.Форма.ФормаЭлемента", 
					Новый Структура("ОткрываемоеЗначение", НоваяКатегория), Элементы.Категории);
			//Чуров
			ОткрытьФорму(Форма);
			//Форма.Открыть();			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КатегорияВверх(Команда)
	Если Элементы.Категории.ТекущиеДанные <> Неопределено Тогда
		ПереместитьКатегориюВверхВниз(Элементы.Категории.ТекущаяСтрока, Истина);
		Элементы.Категории.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КатегорияВниз(Команда)
	Если Элементы.Категории.ТекущиеДанные <> Неопределено Тогда
		ПереместитьКатегориюВверхВниз(Элементы.Категории.ТекущаяСтрока, Ложь);
		Элементы.Категории.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СкопироватьКатегориюНаСервере(СсылкаКопирования, КодНовойКатегории, КодКатегорииРодителя)
	ЭлементОбъект = СсылкаКопирования.Скопировать();
	ЭлементОбъект.Записать();
	
	КодКатегорииРодителя = СсылкаКопирования.Код;
	КодНовойКатегории = ЭлементОбъект.Код;

	Возврат ЭлементОбъект.Ссылка;
КонецФункции

#КонецОбласти

#Область НаИзменение

&НаСервереБезКонтекста
Функция ПолучитьИмяСправочника(ОбъектУчета)
	Возврат Перечисления.ОбъектыУчета.ПолучитьИмяСправочника(ОбъектУчета);
КонецФункции

&НаСервере
Функция ПолучитьМассивОбъектов();
	Массив = Новый Массив();
	ИмяСправочника = Перечисления.ОбъектыУчета.ПолучитьИмяСправочника(Объект.ОбъектУчета);
	
	Для Каждого Элемент Из Объект.Объекты Цикл	
		Выполнить("Массив.Добавить(Справочники." + ИмяСправочника + ".НайтиПоКоду(Элемент.Объект))"); 			
	КонецЦикла;
	Возврат Массив;
КонецФункции

#КонецОбласти

#Область НастройкаПриОткрытии

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПриОткрытииНаКлиенте();
	ПриОткрытииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииНаКлиенте()

	УстановитьЗначениеТипаЗапроса();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеТипаЗапроса()

	Если Объект.ПроизвольнаяПроцедура Тогда
		ТипЗапроса = 2;
	Иначе
		ТипЗапроса = 1;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()

	ОткрытиеСервер();
	ПриОткрытиНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ЗаписьПодтверждениеНастройкиКатегорий

&НаКлиенте
Функция ПолучитьОтборы() Экспорт

	Возврат Компоновщик
		.Настройки
		.ПользовательскиеПоля
		.Элементы[0]
		.Варианты
		.Элементы;

КонецФункции // ()

&НаКлиенте
Процедура ОкончаниеЗаписиПолейОтбора(ИндексыОставляемыхОтборов, ДополнительныеПараметры) Экспорт

	Если ИндексыОставляемыхОтборов = Неопределено Тогда
	
		Возврат;
	
	КонецЕсли;
	
	Компоновщик.Настройки
		.ПользовательскиеПоля
		.Элементы[0]
		.Варианты
		.Элементы.Очистить();
	
	Для каждого Индекс Из ИндексыОставляемыхОтборов Цикл
	
		Попытка
		
			Элемент = ДополнительныеПараметры
				.ПользовательскиеПоля
				.Элементы[0]
				.Варианты
				.Элементы.Получить(Индекс);
			ДополнительныеПараметры
				.ПользовательскиеПоля
				.Элементы[0]
				.Варианты
				.Элементы.Удалить(Элемент);
		
		Исключение
		КонецПопытки;
	
	КонецЦикла;
	Компоновщик.ЗагрузитьНастройки(ДополнительныеПараметры);
	
	ЗаписьСервер();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьПользовательскиеПоляКомпоновщика()
	
	ТекущиеНастройки = ПолучитьОтборы();
	
	ОписаниеЗакрытия = Новый ОписаниеОповещения("ОкончаниеЗаписиПолейОтбора", ЭтотОбъект, Компоновщик.Настройки);
	ОткрытьФорму(
		"ПланВидовХарактеристик.ВидыСкоринга.Форма.ПользовательскиеОтборы",
		, ЭтотОбъект
		,,,,
		ОписаниеЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПоместитьВХранилищеДанные()
	СправочникОбъект = РеквизитФормыВЗначение("Объект");                  
	Если ТипЗапроса = 2 Тогда
		СправочникОбъект.ПроизвольнаяПроцедура = Истина;
	КонецЕсли;	
	СправочникОбъект.ЗаписатьСодержимоеХранилища(Расписание);
	СправочникОбъект.Записать();
	ЗначениеВРеквизитФормы(СправочникОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ОткрытиеСервер()
	//Элементы.Категории.НастройкаОтбора.Владелец.Доступность = Ложь;
	Категории.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = Объект.Ссылка;
	
	СКД = ПланыВидовХарактеристик.ВидыСкоринга.ПолучитьМакет("Макет");

	Настройки = Объект.Ссылка.ПользовательскиеПоля.Получить();
    Если Настройки <> Неопределено Тогда
		Компоновщик.ЗагрузитьНастройки(Настройки);
	КонецЕсли;

	Если СКД = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПервоначальнаяПодготовка = Ложь;
	Если ПустаяСтрока(Объект.ЗапросМакета) Тогда
	
		Объект.ЗапросМакета = СКД.НаборыДанных.НаборДанных1.Запрос;
		ПервоначальнаяПодготовка = Истина;
	
	КонецЕсли;
	
	//Если Объект.Ссылка.Пустая() Тогда
	//	Объект.ЗапросМакета = СКД.НаборыДанных.НаборДанных1.Запрос;	
	//КонецЕсли;
	
	Если Не Объект.ПроизвольнаяПроцедура Тогда
		СКД.НаборыДанных.НаборДанных1.Запрос = Объект.ЗапросМакета;
	КонецЕсли;
	
	Если ПервоначальнаяПодготовка Тогда
		Компоновщик.Настройки.ПользовательскиеПоля.Элементы.Очистить();
		НовоеПП = Компоновщик.Настройки.ПользовательскиеПоля.Элементы.Добавить(
				Тип("ПользовательскоеПолеВыборКомпоновкиДанных"));
		НовоеПП.Заголовок = "Новое пользовательское поле";
		
		Компоновщик.Настройки.Структура.Очистить();
		ГруппировкаКомпоновки = Компоновщик.Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
		ГруппировкаКомпоновки.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		ГруппировкаКомпоновки.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
		
		ПолеПользовательское = ГруппировкаКомпоновки.ПоляГруппировки.Элементы.Добавить(
				Тип("ПолеГруппировкиКомпоновкиДанных")
		);
		ПолеПользовательское.Поле = Новый ПолеКомпоновкиДанных("UserFields.field1");
		
		ПолеДолговоеОбязательство = ГруппировкаКомпоновки.ПоляГруппировки.Элементы.Добавить(
				Тип("ПолеГруппировкиКомпоновкиДанных")
		);
		ПолеДолговоеОбязательство.Поле = Новый ПолеКомпоновкиДанных("ДолговоеОбязательство");
		
		ПолеДолжник = ГруппировкаКомпоновки.ПоляГруппировки.Элементы.Добавить(
				Тип("ПолеГруппировкиКомпоновкиДанных")
		);
		ПолеДолжник.Поле = Новый ПолеКомпоновкиДанных("Должник");
		
		ПолеИсполнительныйЛист = ГруппировкаКомпоновки.ПоляГруппировки.Элементы.Добавить(
				Тип("ПолеГруппировкиКомпоновкиДанных")
		);
		ПолеИсполнительныйЛист.Поле = Новый ПолеКомпоновкиДанных("ИсполнительныйЛист");
		
		ПолеКоличество = ГруппировкаКомпоновки.ПоляГруппировки.Элементы.Добавить(
				Тип("ПолеГруппировкиКомпоновкиДанных")
		);
		ПолеКоличество.Поле = Новый ПолеКомпоновкиДанных("КоличествоДО");
		
		ПолеКоличество = ГруппировкаКомпоновки.ПоляГруппировки.Элементы.Добавить(
				Тип("ПолеГруппировкиКомпоновкиДанных")
		);
		ПолеКоличество.Поле = Новый ПолеКомпоновкиДанных("Исполнитель");

	КонецЕсли;
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	Компоновщик.Инициализировать(Источник);	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	НазначениеИзменениеСервер(ВыбранноеЗначение);
КонецПроцедуры

&НаСервере
Процедура НазначениеИзменениеСервер(Знач ВыбранноеЗначение)
	СКД = ПланыВидовХарактеристик.ВидыСкоринга.ПолучитьМакет("Макет");
	Настройки = Объект.Ссылка.ПользовательскиеПоля.Получить();
	Если Настройки <> Неопределено Тогда
		Компоновщик.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
	    	
	Объект.ЗапросМакета = СКД.НаборыДанных.НаборДанных1.Запрос;		
	СКД.НаборыДанных.НаборДанных1.Запрос = Объект.ЗапросМакета;
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	Компоновщик.Инициализировать(Источник);			
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОткрытиеСервер();
КонецПроцедуры

&НаСервере
Процедура ПереместитьКатегориюВверхВниз(ТекущаяСтрока, ПереместитьВверх)
	НомерСтроки = ТекущаяСтрока.НомерСтроки;	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Категории.НомерСтроки КАК НомерСтроки
	                      |ИЗ
	                      |	Справочник.Категории КАК Категории
	                      |ГДЕ
	                      |	Категории.Владелец = &Владелец
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСтроки УБЫВ");
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Не Результат.Следующий() Тогда
		Возврат;
	КонецЕсли;
	МаксимальныйНомер = Результат.НомерСтроки;
	
	Если Не ((ПереместитьВверх И НомерСтроки > 1) ИЛИ (Не ПереместитьВверх И НомерСтроки < МаксимальныйНомер)) Тогда	
		Возврат;
	КонецЕсли;
		
	Если ПереместитьВверх Тогда	
	    НомерСтроки2 = НомерСтроки - 1;
	Иначе
		НомерСтроки2 = НомерСтроки + 1;
	КонецЕсли;	
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	Запрос.УстановитьПараметр("НомерСтроки2", НомерСтроки2);		
	Запрос.Текст = "ВЫБРАТЬ
	               |	Категории.НомерСтроки КАК НомерСтроки,
	               |	Категории.Ссылка,
	               |	ВЫБОР
	               |		КОГДА Категории.НомерСтроки = &НомерСтроки
	               |			ТОГДА &НомерСтроки2
	               |		ИНАЧЕ &НомерСтроки
	               |	КОНЕЦ КАК НомерСтрокиНовый
	               |ИЗ
	               |	Справочник.Категории КАК Категории
	               |ГДЕ
	               |	Категории.Владелец = &Владелец
	               |	И (Категории.НомерСтроки = &НомерСтроки
	               |			ИЛИ Категории.НомерСтроки = &НомерСтроки2)";
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл;
		ОбъектКатегория = Результат.Ссылка.ПолучитьОбъект();
		ОбъектКатегория.НомерСтроки = Результат.НомерСтрокиНовый;
		ОбъектКатегория.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РасписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Форма = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	//Чуров
	Форма.Показать(Новый ОписаниеОповещения("РасписаниеНачалоВыбораЗавершение", ЭтаФорма));
	//Если Форма.ОткрытьМодально() = Истина Тогда
	//	Расписание = Форма.Расписание;
	//КонецЕсли;
КонецПроцедуры

//Чуров++
&НаКлиенте
Процедура РасписаниеНачалоВыбораЗавершение(ФормаРасписание, ДополнительныеПараметры)  Экспорт
	Расписание = ФормаРасписание;
КонецПроцедуры
//Чуров--

&НаКлиенте
Процедура СоздатьПроизвольнойПроцедурой(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Сообщить("Необходимо записать!");
	Иначе
		Форма = ПолучитьФорму("ПланВидовХарактеристик.ВидыСкоринга.Форма.ФормаЗапроса",, ЭтаФорма);
		Форма.Объект = Объект.Ссылка;
		Форма.ТекстовыйДокумент.УстановитьТекст(Объект.ЗапросМакета);
		Форма.ВходОбъект.Очистить();
		Массив = ПолучитьМассивОбъектов();
		Для Каждого Элемент Из Массив Цикл
			Форма.ВходОбъект.Добавить().Объект = Элемент;
		КонецЦикла;
		
		//Чуров А.И.
		ОткрытьФорму(Форма);

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьСейчас(Команда)
	ФоновыеЗаданияМодуль.СозданиеДокументовСкоринга();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКодЭлемента(Элемент)
	Возврат Элемент.Код;
КонецФункции

&НаКлиенте
Процедура ВосстановитьЭлементОтбора(Элементы, Массив)
	Если Массив.ТипЗначения = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		НовыйОтбор = Элементы.Добавить(Массив.ТипЗначения);
		НовыйОтбор.Использование = Массив.Использование;
		НовыйОтбор.ЛевоеЗначение = Массив.ЛевоеЗначение;
		НовыйОтбор.ВидСравнения = Массив.ВидСравнения;
		НовыйОтбор.ПравоеЗначение = Массив.ПравоеЗначение;
	Иначе
		НовыйОтбор = Элементы.Добавить(Массив.ТипЗначения);
		НовыйОтбор.Использование = Массив.Использование;
        НовыйОтбор.ТипГруппы = Массив.ТипГруппы;
		Для Индекс = 0 По Массив.Элементы.Количество() - 1 Цикл 
			ВосстановитьЭлементОтбора(НовыйОтбор.Элементы, Массив.Элементы[Индекс]);
		КонецЦикла;	
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЭлементОтбора(Элемент, Массив)
	Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
		Массив.Добавить(Новый Структура("ТипЗначения, Использование, ЛевоеЗначение, ВидСравнения, ПравоеЗначение",
				ТипЗнч(Элемент), Элемент.Использование, Элемент.ЛевоеЗначение, Элемент.ВидСравнения,
				Элемент.ПравоеЗначение));
	Иначе
		МассивЭлементов = Новый Массив();		
		Массив.Добавить(Новый Структура("ТипЗначения, Использование, ТипГруппы, Элементы",
				ТипЗнч(Элемент), Элемент.Использование, Элемент.ТипГруппы, МассивЭлементов));
		Для Индекс = 0 По Элемент.Элементы.Количество()-1 Цикл
			ЗаписатьЭлементОтбора(Элемент.Элементы[Индекс], МассивЭлементов);		
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	Если ТипЗапроса = 2 Тогда
		СоздатьПроизвольнойПроцедурой(Команда);	
	Иначе
		СоздатьПоШаблонуДляОбъект(Команда);		
	КонецЕсли;
КонецПроцедуры

#Область ПодВопросом

Процедура ИнициализКомпоновщика()
	СКД = ПланыВидовХарактеристик.ВидыСкоринга.ПолучитьМакет("Макет");
    СКД.НаборыДанных.НаборДанных1.Запрос = Объект.ЗапросМакета;

	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	Компоновщик.Инициализировать(Источник);	
КонецПроцедуры	

#КонецОбласти
